/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isalnum.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mac <mac@student.42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/01/17 15:23:06 by mac               #+#    #+#             */
/*   Updated: 2023/01/19 20:06:18 by mac              ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int isalnum(int c) // проверяет принадлежит ли символ к буквам или цифрам
{   
    if (ft_isalpha(c) || ft_isdigit(c))
		return (1);
	else
		return (0);
}